import { useState, useEffect, useRef } from "react";
import "./ProductBuy.css";
import { Link } from "react-router-dom";
import { useCart } from "../../../Contexts/CartContext";
import type { product as ProductType } from "../../../api/products";

type ProductBuyPopupProps = {
  product: ProductType;
  count: number;
};

export default function ProductBuy({ product, count  }: ProductBuyPopupProps) {
  const { addToCart } = useCart();

  const [isOpen, setIsOpen] = useState(false);

  const modalRef = useRef<HTMLDivElement>(null);

  const handleAddToCart = () => {
    addToCart({
      ...product,
      count, // تعداد اولیه
    });
    setIsOpen(true);
  };

  // بستن مدال با کلیک روی دکمه esc
  useEffect(() => {
    const handleKeyDown = (e: KeyboardEvent) => {
      if (e.key === "Escape") setIsOpen(false);
    };
    if (isOpen) {
      document.addEventListener("keydown", handleKeyDown);
    }
    return () => document.removeEventListener("keydown", handleKeyDown);
  }, [isOpen]);

  // بستن مدال با کلیک روی بیرون اون
  const handleOverlayClick = (e: React.MouseEvent<HTMLDivElement>) => {
    if (modalRef.current && !modalRef.current.contains(e.target as Node)) {
      setIsOpen(false);
    }
  };

  return (
    <>
      {/* دکمه SVG که باز می‌کنه */}
      <button
        className="product__add-to-shopping-card"
        onClick={handleAddToCart}
      >
        <svg
          width="24"
          height="24"
          viewBox="0 0 24 24"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M18.8541 17.75H8.20406C7.21406 17.75 6.26406 17.33 5.59406 16.6C4.92406 15.87 4.58406 14.89 4.66406 13.9L5.49406 3.94C5.52406 3.63 5.41406 3.33001 5.20406 3.10001C4.99406 2.87001 4.70406 2.75 4.39406 2.75H2.66406C2.25406 2.75 1.91406 2.41 1.91406 2C1.91406 1.59 2.25406 1.25 2.66406 1.25H4.40407C5.13407 1.25 5.82406 1.56 6.31406 2.09C6.58406 2.39 6.78406 2.74 6.89406 3.13H19.3841C20.3941 3.13 21.3241 3.53 22.0041 4.25C22.6741 4.98 23.0141 5.93 22.9341 6.94L22.3941 14.44C22.2841 16.27 20.6841 17.75 18.8541 17.75ZM6.94406 4.62L6.16406 14.02C6.11406 14.6 6.30406 15.15 6.69406 15.58C7.08406 16.01 7.62406 16.24 8.20406 16.24H18.8541C19.8941 16.24 20.8341 15.36 20.9141 14.32L21.4541 6.82001C21.4941 6.23001 21.3041 5.67001 20.9141 5.26001C20.5241 4.84001 19.9841 4.60999 19.3941 4.60999H6.94406V4.62Z"
            fill="white"
          />
          <path
            d="M16.9141 22.75C15.8141 22.75 14.9141 21.85 14.9141 20.75C14.9141 19.65 15.8141 18.75 16.9141 18.75C18.0141 18.75 18.9141 19.65 18.9141 20.75C18.9141 21.85 18.0141 22.75 16.9141 22.75ZM16.9141 20.25C16.6341 20.25 16.4141 20.47 16.4141 20.75C16.4141 21.03 16.6341 21.25 16.9141 21.25C17.1941 21.25 17.4141 21.03 17.4141 20.75C17.4141 20.47 17.1941 20.25 16.9141 20.25Z"
            fill="white"
          />
          <path
            d="M8.91406 22.75C7.81406 22.75 6.91406 21.85 6.91406 20.75C6.91406 19.65 7.81406 18.75 8.91406 18.75C10.0141 18.75 10.9141 19.65 10.9141 20.75C10.9141 21.85 10.0141 22.75 8.91406 22.75ZM8.91406 20.25C8.63406 20.25 8.41406 20.47 8.41406 20.75C8.41406 21.03 8.63406 21.25 8.91406 21.25C9.19406 21.25 9.41406 21.03 9.41406 20.75C9.41406 20.47 9.19406 20.25 8.91406 20.25Z"
            fill="white"
          />
          <path
            d="M21.6641 8.75H9.66406C9.25406 8.75 8.91406 8.41 8.91406 8C8.91406 7.59 9.25406 7.25 9.66406 7.25H21.6641C22.0741 7.25 22.4141 7.59 22.4141 8C22.4141 8.41 22.0741 8.75 21.6641 8.75Z"
            fill="white"
          />
        </svg>
        افزودن به سبد خرید
      </button>

      {/* پاپ آپ */}
      {isOpen && (
        <div className="popup-buy-overlay" onClick={handleOverlayClick}>
          <div className="popup-buy-content" ref={modalRef}>
            <div className="popup-buy-top">
              <p className="pop-buy-title">این کالا به سبد خریدت اضافه شد!</p>
              <button
                className="close-buy-btn"
                onClick={() => setIsOpen(false)}
              >
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="20"
                  height="20"
                  viewBox="0 0 20 20"
                  fill="none"
                >
                  <path
                    d="M7.64245 12.9841C7.48411 12.9841 7.32578 12.9258 7.20078 12.8008C6.95911 12.5591 6.95911 12.1591 7.20078 11.9174L11.9174 7.20078C12.1591 6.95911 12.5591 6.95911 12.8008 7.20078C13.0424 7.44245 13.0424 7.84245 12.8008 8.08411L8.08411 12.8008C7.96745 12.9258 7.80078 12.9841 7.64245 12.9841Z"
                    fill="#032340"
                  />
                  <path
                    d="M12.3591 12.9841C12.2008 12.9841 12.0424 12.9258 11.9174 12.8008L7.20078 8.08411C6.95911 7.84245 6.95911 7.44245 7.20078 7.20078C7.44245 6.95911 7.84245 6.95911 8.08411 7.20078L12.8008 11.9174C13.0424 12.1591 13.0424 12.5591 12.8008 12.8008C12.6758 12.9258 12.5174 12.9841 12.3591 12.9841Z"
                    fill="#032340"
                  />
                  <path
                    d="M12.5013 18.9587H7.5013C2.9763 18.9587 1.04297 17.0253 1.04297 12.5003V7.50033C1.04297 2.97533 2.9763 1.04199 7.5013 1.04199H12.5013C17.0263 1.04199 18.9596 2.97533 18.9596 7.50033V12.5003C18.9596 17.0253 17.0263 18.9587 12.5013 18.9587ZM7.5013 2.29199C3.65964 2.29199 2.29297 3.65866 2.29297 7.50033V12.5003C2.29297 16.342 3.65964 17.7087 7.5013 17.7087H12.5013C16.343 17.7087 17.7096 16.342 17.7096 12.5003V7.50033C17.7096 3.65866 16.343 2.29199 12.5013 2.29199H7.5013Z"
                    fill="#032340"
                  />
                </svg>
              </button>
            </div>

            <div className="popup-buy-buttom">
              <div className="popup-product-detail">
                <div className="popup__product-image">
                  <img src={product.image} alt={product.title} />
                </div>
                <p className="popup__product-title">{product.title}</p>
              </div>

              <Link to="/shoppingcard">
                <button className="popup__shoping-cart">
                  <svg
                    width="25"
                    height="24"
                    viewBox="0 0 25 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M12.5019 16.3299C10.1119 16.3299 8.17188 14.3899 8.17188 11.9999C8.17188 9.60992 10.1119 7.66992 12.5019 7.66992C14.8919 7.66992 16.8319 9.60992 16.8319 11.9999C16.8319 14.3899 14.8919 16.3299 12.5019 16.3299ZM12.5019 9.16992C10.9419 9.16992 9.67188 10.4399 9.67188 11.9999C9.67188 13.5599 10.9419 14.8299 12.5019 14.8299C14.0619 14.8299 15.3319 13.5599 15.3319 11.9999C15.3319 10.4399 14.0619 9.16992 12.5019 9.16992Z"
                      fill="currentColor"
                    />
                    <path
                      d="M12.4981 21.0205C8.73812 21.0205 5.18813 18.8205 2.74812 15.0005C1.68813 13.3505 1.68813 10.6605 2.74812 9.00047C5.19812 5.18047 8.74813 2.98047 12.4981 2.98047C16.2481 2.98047 19.7981 5.18047 22.2381 9.00047C23.2981 10.6505 23.2981 13.3405 22.2381 15.0005C19.7981 18.8205 16.2481 21.0205 12.4981 21.0205ZM12.4981 4.48047C9.26813 4.48047 6.17813 6.42047 4.01813 9.81047C3.26813 10.9805 3.26813 13.0205 4.01813 14.1905C6.17813 17.5805 9.26813 19.5205 12.4981 19.5205C15.7281 19.5205 18.8181 17.5805 20.9781 14.1905C21.7281 13.0205 21.7281 10.9805 20.9781 9.81047C18.8181 6.42047 15.7281 4.48047 12.4981 4.48047Z"
                      fill="currentColor"
                    />
                  </svg>
                  مشاهده سبد خرید
                </button>
              </Link>
            </div>
          </div>
        </div>
      )}
    </>
  );
}
