import React from "react";
import "./ShoppingCardSum.css"

export default function ShoppingCardSum() {
  return (
    <div className="shoppingcard-left">
      <div className="shoppingcard-left-top">
        <h3 className="shopping__discount-code">کد تخفیف</h3>

        <div className="shopping__discount-holder">
          <input type="text" className="shopping__discount-input" />

          <button className="shopping__discount-submit">
            <svg
              width="25"
              height="24"
              viewBox="0 0 25 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M12.5 22.75C6.57 22.75 1.75 17.93 1.75 12C1.75 6.07 6.57 1.25 12.5 1.25C18.43 1.25 23.25 6.07 23.25 12C23.25 17.93 18.43 22.75 12.5 22.75ZM12.5 2.75C7.4 2.75 3.25 6.9 3.25 12C3.25 17.1 7.4 21.25 12.5 21.25C17.6 21.25 21.75 17.1 21.75 12C21.75 6.9 17.6 2.75 12.5 2.75Z"
                fill="currentColor"
              />
              <path
                d="M11.0814 15.5796C10.8814 15.5796 10.6914 15.4996 10.5514 15.3596L7.72141 12.5296C7.43141 12.2396 7.43141 11.7596 7.72141 11.4696C8.01141 11.1796 8.49141 11.1796 8.78141 11.4696L11.0814 13.7696L16.2214 8.62961C16.5114 8.33961 16.9914 8.33961 17.2814 8.62961C17.5714 8.91961 17.5714 9.39961 17.2814 9.68961L11.6114 15.3596C11.4714 15.4996 11.2814 15.5796 11.0814 15.5796Z"
                fill="currentColor"
              />
            </svg>
            ثبت
          </button>
        </div>
      </div>

      <div className="shoppingcard-left-center">
        <div className="cart-summary__item">
          <span>قیمت کالاها</span>
          <span>۴۵۰٬۰۰۰ تومان</span>
        </div>

        <div className="cart-summary__item">
          <span className="cart-summary__profit">سود شما از خرید</span>
          <span className="cart-summary__profit">۱۵۰,۰۰۰ تومان</span>
        </div>

        <div className="cart-summary__item">
          <span>هزینه ارسال</span>
          <span>۳۵,۰۰۰ تومان</span>
        </div>
      </div>
      <div className="shoppingcard-left-bottom">
        <div className="cart-sum__item">
          <span>مبلغ قابل پرداخت</span>
          <span>۱۵۰,۰۰۰ تومان</span>
        </div>

        <button className="cart-buy-item">
          <svg
            width="24"
            height="24"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M18.8541 17.75H8.20406C7.21406 17.75 6.26406 17.33 5.59406 16.6C4.92406 15.87 4.58406 14.89 4.66406 13.9L5.49406 3.94C5.52406 3.63 5.41406 3.33001 5.20406 3.10001C4.99406 2.87001 4.70406 2.75 4.39406 2.75H2.66406C2.25406 2.75 1.91406 2.41 1.91406 2C1.91406 1.59 2.25406 1.25 2.66406 1.25H4.40407C5.13407 1.25 5.82406 1.56 6.31406 2.09C6.58406 2.39 6.78406 2.74 6.89406 3.13H19.3841C20.3941 3.13 21.3241 3.53 22.0041 4.25C22.6741 4.98 23.0141 5.93 22.9341 6.94L22.3941 14.44C22.2841 16.27 20.6841 17.75 18.8541 17.75ZM6.94406 4.62L6.16406 14.02C6.11406 14.6 6.30406 15.15 6.69406 15.58C7.08406 16.01 7.62406 16.24 8.20406 16.24H18.8541C19.8941 16.24 20.8341 15.36 20.9141 14.32L21.4541 6.82001C21.4941 6.23001 21.3041 5.67001 20.9141 5.26001C20.5241 4.84001 19.9841 4.60999 19.3941 4.60999H6.94406V4.62Z"
              fill="white"
            />
            <path
              d="M16.9141 22.75C15.8141 22.75 14.9141 21.85 14.9141 20.75C14.9141 19.65 15.8141 18.75 16.9141 18.75C18.0141 18.75 18.9141 19.65 18.9141 20.75C18.9141 21.85 18.0141 22.75 16.9141 22.75ZM16.9141 20.25C16.6341 20.25 16.4141 20.47 16.4141 20.75C16.4141 21.03 16.6341 21.25 16.9141 21.25C17.1941 21.25 17.4141 21.03 17.4141 20.75C17.4141 20.47 17.1941 20.25 16.9141 20.25Z"
              fill="white"
            />
            <path
              d="M8.91406 22.75C7.81406 22.75 6.91406 21.85 6.91406 20.75C6.91406 19.65 7.81406 18.75 8.91406 18.75C10.0141 18.75 10.9141 19.65 10.9141 20.75C10.9141 21.85 10.0141 22.75 8.91406 22.75ZM8.91406 20.25C8.63406 20.25 8.41406 20.47 8.41406 20.75C8.41406 21.03 8.63406 21.25 8.91406 21.25C9.19406 21.25 9.41406 21.03 9.41406 20.75C9.41406 20.47 9.19406 20.25 8.91406 20.25Z"
              fill="white"
            />
            <path
              d="M21.6641 8.75H9.66406C9.25406 8.75 8.91406 8.41 8.91406 8C8.91406 7.59 9.25406 7.25 9.66406 7.25H21.6641C22.0741 7.25 22.4141 7.59 22.4141 8C22.4141 8.41 22.0741 8.75 21.6641 8.75Z"
              fill="white"
            />
          </svg>
          تکمیل به سبد خرید
        </button>
      </div>
    </div>
  );
}
