// menuData.ts

// تایپ کلی
export interface SubMenuCategory {
  title: string;
  items: string[];
}

export interface SubMenuData {
  categories: SubMenuCategory[];
}

// دیتای منوها
export const menSubMenu: SubMenuData = {
  categories: [
    {
      title: "لباس ورزشی زنانه",
      items: ["ست لباس ورزشی", "تیشرت ,بلوز و استرچ ورزشی", "نیم تنه ورزشی", "تاب ورزشی", "کیت ورزشی", "سویشرت", "هودی", "مایو"],
    },
    {
      title: "شلوار ورزشی زنانه",
      items: ["شلوار ورزشی", "شلوارک ورزشی", "لگ و نیم لگ", "جاگر"],
    },
    {
      title: "کفش ورزشی",
      items: ["کتونی رانینگ", "کتونی پیاده‌روی", "کفش اسکیت","کفش کوهنوردی","کفش بسکتبال","کفش کشتی","استوک","دمبایی"],
    },
    {
      title: "برند پیشنهادی",
      items: ["nike", "the north face", "under armour", "adidas", "fila"],
    },
    {
      title: "اکسسوری",
      items: ["جوراب ورزشی", "کلاه ورزشی", "دستبند ورزشی", "هدبند"],
    },
    {
      title: "جوراب ورزشی",
      items: ["جوراب ورزشی",],
    },
  ],
};
export const womenSubMenu: SubMenuData = {
  categories: [
    {
      title: "لباس ورزشی زنانه",
      items: ["ست لباس ورزشی", "تیشرت ,بلوز و استرچ ورزشی", "نیم تنه ورزشی", "تاب ورزشی", "کیت ورزشی", "سویشرت", "هودی", "مایو"],
    },
    {
      title: "شلوار ورزشی زنانه",
      items: ["شلوار ورزشی", "شلوارک ورزشی", "لگ و نیم لگ", "جاگر"],
    },
    {
      title: "کفش ورزشی",
      items: ["کتونی رانینگ", "کتونی پیاده‌روی", "کفش اسکیت","کفش کوهنوردی","کفش بسکتبال","کفش کشتی","استوک","دمبایی"],
    },
    {
      title: "برند پیشنهادی",
      items: ["nike", "the north face", "under armour", "adidas", "fila"],
    },
    {
      title: "اکسسوری",
      items: ["جوراب ورزشی", "کلاه ورزشی", "دستبند ورزشی", "هدبند"],
    },
    {
      title: "جوراب ورزشی",
      items: ["جوراب ورزشی",],
    },
  ],
};
export const kidSubMenu: SubMenuData = {
  categories: [
    {
      title: "لباس ورزشی زنانه",
      items: ["ست لباس ورزشی", "تیشرت ,بلوز و استرچ ورزشی", "نیم تنه ورزشی", "تاب ورزشی", "کیت ورزشی", "سویشرت", "هودی", "مایو"],
    },
    {
      title: "شلوار ورزشی زنانه",
      items: ["شلوار ورزشی", "شلوارک ورزشی", "لگ و نیم لگ", "جاگر"],
    },
    {
      title: "کفش ورزشی",
      items: ["کتونی رانینگ", "کتونی پیاده‌روی", "کفش اسکیت","کفش کوهنوردی","کفش بسکتبال","کفش کشتی","استوک","دمبایی"],
    },
    {
      title: "برند پیشنهادی",
      items: ["nike", "the north face", "under armour", "adidas", "fila"],
    },
    {
      title: "اکسسوری",
      items: ["جوراب ورزشی", "کلاه ورزشی", "دستبند ورزشی", "هدبند"],
    },
    {
      title: "جوراب ورزشی",
      items: ["جوراب ورزشی",],
    },
  ],
};
export const sportSubMenu: SubMenuData = {
  categories: [
    {
      title: "لوازم ورزش",
      items: ["وزنه و دمبل", "لوازم یوگا و بیلاتس", "لوازم فیتنس و بدنسازی",],
    },
    {
      title: "وسایل ورزشی",
      items: ["مچ بند ,ساق بند ,زانو بند ", "ساک ورزشی", "وسایل شنا",],
    },
    {
      title: "لوازم دیگر",
      items: ["کتونی رانینگ", "کوله و شوزبگ", "لوازم دیگر",],
    },
    {
      title: "اکسسوری",
      items: ["جوراب ورزشی", "کلاه ورزشی", "دستبند ورزشی", "هدبند"],
    },
    {
      title: "جوراب ورزشی",
      items: ["جوراب ورزشی",],
    },
    {
      title: "برند پیشنهادی",
      items: ["nike", "under armour",],
    },
  ],
};
export const shakerSubMenu: SubMenuData = {
  categories: [
    {
      title: "شیکر",
      items: ["شیکر بدنسازی", "مخلوط کن و شیکر برقی",],
    },
    {
      title: "ماگ و فلاسک",
      items: ["ماگ و فلاسک",],
    },
    {
      title: "جا بودری و جا قرصی",
      items: ["جا بودری و جا قرصی",],
    },
    {
      title: "قمقمه ورزشی",
      items: ["قمقمه ورزشی",],
    },
    {
      title: "اکسسوری",
      items: ["جوراب ورزشی", "کلاه ورزشی", "دستبند ورزشی", "هدبند","دستبند","مچ بند"],
    },
    {
      title: "جوراب ورزشی",
      items: ["جوراب ورزشی",],
    },
  ],
};